# Lab | Pandas

Objective: practice how to use the pandas library in Python for data analysis and manipulation.

In this lab, we will be working with the customer data from an insurance company, which can be found in the CSV file located at the following link: https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv

The data includes information such as customer ID, state, gender, education, income, and other variables that can be used to perform various analyses.

Throughout the lab, we will be using the pandas library in Python to manipulate and analyze the data. Pandas is a powerful library that provides various data manipulation and analysis tools, including the ability to load and manipulate data from a variety of sources, including CSV files.

### Data Description

- Customer - Customer ID

- ST - State where customers live

- Gender - Gender of the customer

- Education - Background education of customers 

- Customer Lifetime Value - Customer lifetime value(CLV) is the total revenue the client will derive from their entire relationship with a customer. In other words, is the predicted or calculated value of a customer over their entire duration as a policyholder with the insurance company. It is an estimation of the net profit that the insurance company expects to generate from a customer throughout their relationship with the company. Customer Lifetime Value takes into account factors such as the duration of the customer's policy, premium payments, claim history, renewal likelihood, and potential additional services or products the customer may purchase. It helps insurers assess the long-term profitability and value associated with retaining a particular customer.

- Income - Customers income

- Monthly Premium Auto - Amount of money the customer pays on a monthly basis as a premium for their auto insurance coverage. It represents the recurring cost that the insured person must pay to maintain their insurance policy and receive coverage for potential damages, accidents, or other covered events related to their vehicle.

- Number of Open Complaints - Number of complaints the customer opened

- Policy Type - There are three type of policies in car insurance (Corporate Auto, Personal Auto, and Special Auto)

- Vehicle Class - Type of vehicle classes that customers have Two-Door Car, Four-Door Car SUV, Luxury SUV, Sports Car, and Luxury Car

- Total Claim Amount - the sum of all claims made by the customer. It represents the total monetary value of all approved claims for incidents such as accidents, theft, vandalism, or other covered events.

External Resources: https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9

In [1]:
#import pandas and data

import pandas as pd
pd.set_option(“max_colwidth”, None)


df = pd.read_csv("https://raw.githubusercontent.com/data-bootcamp-v4/data/main/file1.csv")

## Challenge 1: Understanding the data

In this challenge, you will use pandas to explore a given dataset. Your task is to gain a deep understanding of the data by analyzing its characteristics, dimensions, and statistical properties.

- Identify the dimensions of the dataset by determining the number of rows and columns it contains.
- Determine the data types of each column and evaluate whether they are appropriate for the nature of the variable. You should also provide suggestions for fixing any incorrect data types.
- Identify the number of unique values for each column and determine which columns appear to be categorical. You should also describe the unique values of each categorical column and the range of values for numerical columns, and give your insights.
- Compute summary statistics such as mean, median, mode, standard deviation, and quartiles to understand the central tendency and distribution of the data for numerical columns. You should also provide your conclusions based on these summary statistics.
- Compute summary statistics for categorical columns and providing your conclusions based on these statistics.

In [5]:
df.shape

(4008, 11)

In [38]:
print("The DataFrame has {} rows and {} columns".format(df.shape[0],df.shape[1]))

The DataFrame has 4008 rows and 11 columns

In [2]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4008 entries, 0 to 4007
Data columns (total 11 columns):
 #   Column                     Non-Null Count  Dtype
---  ------                     --------------  -----
 0   Customer                   1071 non-null   object
 1   ST                         1071 non-null   object
 2   GENDER                     954 non-null    object
 3   Education                  1071 non-null   object
 4   Customer Lifetime Value    1068 non-null   object
 5   Income                     1071 non-null   float64
 6   Monthly Premium Auto       1071 non-null   float64
 7   Number of Open Complaints  1071 non-null   object
 8   Policy Type                1071 non-null   object
 9   Vehicle Class              1071 non-null   object
 10  Total Claim Amount         1071 non-null   float64
dtypes: float64(3), object(8)
memory usage: 344.6+ KB

In [4]:
df.head(3)

,Customer,ST,GENDER,Education,Customer Lifetime Value,Income,Monthly Premium Auto,Number of Open Complaints,Policy Type,Vehicle Class,Total Claim Amount
0,RB50392,Washington,NaN,Master,NaN,0.0,1000.0,1/0/00,Personal Auto,Four-Door Car,2.704934
1,QZ44356,Arizona,F,Bachelor,697953.59%,0.0,94.0,1/0/00,Personal Auto,Four-Door Car,1131.464935
2,AI49188,Nevada,F,Bachelor,1288743.17%,48767.0,108.0,1/0/00,Personal Auto,Two-Door Car,566.472247

Three columns - `Income`, `Monthly Premium Auto`, `Total Claim Amount` - are `floats`, the rest have the `object` datatype. The column `Customer Lifetime Value` which is now an `object` should perhaps also be a `float` since it is a numeric value.

In [30]:
cols = pd.Series(df.columns, name='col_name')
unique_values = pd.Series(df[col].nunique() for col in df.columns)
nunique_df = pd.concat([cols,unique_values], axis=1)
nunique_df

                     col_name     0
0                    Customer  1071
1                          ST     8
2                      GENDER     5
3                   Education     6
4     Customer Lifetime Value  1027
5                      Income   774
6        Monthly Premium Auto   132
7   Number of Open Complaints     6
8                 Policy Type     3
9               Vehicle Class     6
10         Total Claim Amount   761

### Categorical Variables

The following columns contain categorical variables:
- ST
- GENDER
- Education
- Policy Type
- Vehicle Class

In [63]:
#unique categorical values
cat_cols = ['ST', 'GENDER', 'Education', 'Policy Type', 'Vehicle Class']
cat_series=pd.Series(cat_cols)
cat_values = pd.Series(df[col].unique() for col in cat_cols)

unique_df = pd.concat([cat_series,cat_values], axis=1)
unique_df

,0,1
0,ST,"[Washington, Arizona, Nevada, California, Oregon, Cali, AZ, WA, nan]"
1,GENDER,"[nan, F, M, Femal, Male, female]"
2,Education,"[Master, Bachelor, High School or Below, College, Bachelors, Doctor, nan]"
3,Policy Type,"[Personal Auto, Corporate Auto, Special Auto, nan]"
4,Vehicle Class,"[Four-Door Car, Two-Door Car, SUV, Luxury SUV, Sports Car, Luxury Car, nan]"

### Issues with categorical variables
- the State column contains state values that are non-consistent. For example, 'Arizona' and 'AZ' and 'California' and 'Cali'. There are also missing values (nan).
- Gender and Education columns have the same problem
- In the column Policy Type, the word 'Auto' is redundant if there are only 'Auto' type policies

### Range of numeric values

In [57]:
numerical_df = df[["Income","Monthly Premium Auto", "Total Claim Amount"]]
num_min_max = numerical_df.agg(['min','max'])
num_min_max

      Income  Monthly Premium Auto  Total Claim Amount
min      0.0                  61.0            0.382107
max  99960.0               35354.0         2893.239678

### Summary statistics of numeric values

In [39]:
df.describe()

             Income  Monthly Premium Auto  Total Claim Amount
count   1071.000000           1071.000000         1071.000000
mean   39295.701214            193.234360          404.986909
std    30469.427060           1601.190369          293.027260
min        0.000000             61.000000            0.382107
25%    14072.000000             68.000000          202.157702
50%    36234.000000             83.000000          354.729129
75%    64631.000000            109.500000          532.800000
max    99960.000000          35354.000000         2893.239678

In [62]:
import numpy as np
import statistics as stat
num_central = numerical_df.agg([np.mean,np.median,stat.mode])
num_central

              Income  Monthly Premium Auto  Total Claim Amount
mean    39295.701214             193.23436          404.986909
median  36234.000000              83.00000          354.729129
mode        0.000000              65.00000          321.600000

In [69]:
df.columns

Index(['Customer', 'ST', 'GENDER', 'Education', 'Customer Lifetime Value',
       'Income', 'Monthly Premium Auto', 'Number of Open Complaints',
       'Policy Type', 'Vehicle Class', 'Total Claim Amount'],
      dtype='object')

### Categorical frequencies

In [106]:
for col in cat_cols:
    print(df[col].value_counts())
    print()

ST
Oregon        320
California    211
Arizona       186
Cali          120
Nevada         98
Washington     81
WA             30
AZ             25
Name: count, dtype: int64

GENDER
F         457
M         413
Male       39
female     28
Femal      17
Name: count, dtype: int64

Education
Bachelor                324
College                 313
High School or Below    296
Master                   94
Doctor                   37
Bachelors                 7
Name: count, dtype: int64

Policy Type
Personal Auto     780
Corporate Auto    234
Special Auto       57
Name: count, dtype: int64

Vehicle Class
Four-Door Car    576
Two-Door Car     205
SUV              199
Sports Car        57
Luxury SUV        20
Luxury Car        14
Name: count, dtype: int64

## Challenge 2: analyzing the data

### Exercise 1

The marketing team wants to know the top 5 less common customer locations. Create a pandas Series object that contains the customer locations and their frequencies, and then retrieve the top 5 less common locations in ascending order.

In [79]:
# Your code here
df['ST'].value_counts(ascending=True)[:5]

ST
AZ             25
WA             30
Washington     81
Nevada         98
Cali          120
Name: count, dtype: int64

### Exercise 2

Your goal is to identify customers with a high policy claim amount.

Instructions:

- Review again the statistics for total claim amount to gain an understanding of the data.
- To identify potential areas for improving customer retention and profitability, we want to focus on customers with a high policy claim amount. Consider customers with a high policy claim amount to be those in the top 25% of the total claim amount. Create a pandas DataFrame object that contains information about customers with a policy claim amount greater than the 75th percentile.
- Use DataFrame methods to calculate summary statistics about the high policy claim amount data.

*Note: When analyzing data, we often want to focus on certain groups of values to gain insights. Percentiles are a useful tool to help us define these groups. A percentile is a measure that tells us what percentage of values in a dataset are below a certain value. For example, the 75th percentile represents the value below which 75% of the data falls. Similarly, the 25th percentile represents the value below which 25% of the data falls. When we talk about the top 25%, we are referring to the values that fall above the 75th percentile, which represent the top quarter of the data. On the other hand, when we talk about the bottom 25%, we are referring to the values that fall below the 25th percentile, which represent the bottom quarter of the data. By focusing on these groups, we can identify patterns and trends that may be useful for making decisions and taking action.*

*Hint: look for a method that gives you the percentile or quantile 0.75 and 0.25 for a Pandas Series.*

*Hint 2: check `Boolean selection according to the values of a single column` in https://towardsdatascience.com/filtering-data-frames-in-pandas-b570b1f834b9*

In [84]:
# Your code here
high_claims = df[df['Total Claim Amount']>=df['Total Claim Amount'].quantile(0.75)]

In [85]:
high_claims.describe()

             Income  Monthly Premium Auto  Total Claim Amount
count    273.000000            273.000000          273.000000
mean   24106.545788            163.000000          774.005353
std    27542.717560            613.645376          291.304731
min        0.000000             63.000000          532.800000
25%        0.000000             99.000000          595.200000
50%    18846.000000            113.000000          673.342650
75%    44897.000000            133.000000          844.481918
max    99316.000000          10202.000000         2893.239678

### Exercise 3

The sales team wants to know the total number of policies sold for each type of policy. Create a pandas Series object that contains the policy types and their total number of policies sold, and then retrieve the policy type with the highest number of policies sold.

*Hint:*
- *Using value_counts() method simplifies this analysis.*
- *Futhermore, there is a method that returns the index of the maximum value in a column or row.*

In [92]:
df['Policy Type'].value_counts()

Policy Type
Personal Auto     780
Corporate Auto    234
Special Auto       57
Name: count, dtype: int64

In [93]:
df['Policy Type'].value_counts().idxmax()

'Personal Auto'

### Exercise 4

The sales team wants to know if customers with Personal Auto have a income than those with Corporate Auto. How does the average income compare between the two policy types?

- Use *loc* to create two dataframes: one containing only Personal Auto policies and one containing only Corporate Auto policies.
- Calculate the average income for each policy.
- Print the results.

In [98]:
personal = df.loc[df['Policy Type']=='Personal Auto']
personal_income_avg = personal['Income'].mean()
print(personal_income_avg)

38180.69871794872

In [99]:
corporate = df.loc[df['Policy Type']=='Corporate Auto']
corporate_income_avg = corporate['Income'].mean()
print(corporate_income_avg)

41390.31196581197

In [103]:
#trying the above in a function
def avg_income(df,policy):
    df_temp = df.loc[df['Policy Type']== policy]
    df_temp_avg = df_temp['Income'].mean()
    return df_temp_avg

In [104]:
personal = avg_income(df,'Personal Auto')
personal

38180.69871794872

In [105]:
corporate = avg_income(df,'Corporate Auto')
corporate

41390.31196581197

#### Corporate Auto policy holders have a higher income on average.